#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_integer.name_suffix: Refreshing state... [id=16590]
azurerm_resource_group.app_service: Refreshing state... [id=/subscriptions/50bc6626-cc4a-472c-9465-eb0eb6eb9f55/resourceGroups/testproj-16590]
azurerm_app_service_plan.app_service: Refreshing state... [id=/subscriptions/50bc6626-cc4a-472c-9465-eb0eb6eb9f55/resourceGroups/testproj-16590/providers/Microsoft.Web/serverfarms/testproj-16590]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_resource_group.app_service has been changed
  ~ resource "azurerm_resource_group" "app_service" {
        id       = "/subscriptions/50bc6626-cc4a-472c-9465-eb0eb6eb9f55/resourceGroups/testproj-16590"
        name     = "testproj-16590"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }
  # azurerm_app_service_plan.app_service has been changed
  ~ resource "azurerm_app_service_plan" "app_service" {
        id                           = "/subscriptions/50bc6626-cc4a-472c-9465-eb0eb6eb9f55/resourceGroups/testproj-16590/providers/Microsoft.Web/serverfarms/testproj-16590"
        name                         = "testproj-16590"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_app_service.app_service will be created
  + resource "azurerm_app_service" "app_service" {
      + app_service_plan_id               = "/subscriptions/50bc6626-cc4a-472c-9465-eb0eb6eb9f55/resourceGroups/testproj-16590/providers/Microsoft.Web/serverfarms/testproj-16590"
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "eastus"
      + name                              = "testproj-16590"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "testproj-16590"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = (known after apply)
          + acr_user_managed_identity_client_id  = (known after apply)
          + always_on                            = (known after apply)
          + app_command_line                     = (known after apply)
          + auto_swap_slot_name                  = (known after apply)
          + default_documents                    = (known after apply)
          + dotnet_framework_version             = (known after apply)
          + ftps_state                           = (known after apply)
          + health_check_path                    = (known after apply)
          + http2_enabled                        = (known after apply)
          + ip_restriction                       = (known after apply)
          + java_container                       = (known after apply)
          + java_container_version               = (known after apply)
          + java_version                         = (known after apply)
          + linux_fx_version                     = (known after apply)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + php_version                          = (known after apply)
          + python_version                       = (known after apply)
          + remote_debugging_enabled             = (known after apply)
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = (known after apply)
          + use_32_bit_worker_process            = (known after apply)
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = "main"
          + manual_integration = true
          + repo_url           = "https://github.com/khaledm/testproj"
          + rollback_enabled   = (known after apply)
          + use_mercurial      = false
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.app_service will be updated in-place
  ~ resource "azurerm_app_service_plan" "app_service" {
        id                           = "/subscriptions/50bc6626-cc4a-472c-9465-eb0eb6eb9f55/resourceGroups/testproj-16590/providers/Microsoft.Web/serverfarms/testproj-16590"
        name                         = "testproj-16590"
        tags                         = {}
        # (9 unchanged attributes hidden)

      ~ sku {
          ~ tier     = "Standard" -> "Free"
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @khaledm, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*